/*Дано змінну time яка рівна числу від 0 до 59.
Потрібно написати код, який перевірить, до якої четверті години попадає число
(в першу, другу, третю или четверту частину години).*/

let time = 59;
if (time < 15) {
    console.log('Перша чверть години');
}
else {
    if (time < 30) {
        console.log('Друга чверть години');
    }
    else {
        if (time < 45) {
            console.log('Третя чверть години');
        }
        else {
            console.log('Четверта чверть години');
        }
    }
}
